In [30]:
import pandas as pd

achievement_file = "data/achievement_file.csv"
SIS_file = "data/SIS_file.csv"
usage_file = "data/usage_file.csv"

ach_data = pd.read_csv(achievement_file)
ach_data.head()

,Student Number,Grade Level,Pre-Achievement Date,Pre-Achievement Score,Post-Achievement Date,Post-Achievement Score
0,G4_21500490,4,42955,15.0,43235,16.0
1,G4_21500491,4,42955,20.0,43235,20.0
2,G4_21500492,4,42955,10.0,43235,7.0
3,G4_21500493,4,42955,30.0,43235,25.0
4,G4_21500494,4,42955,40.0,43235,50.0

In [31]:
sis_data = pd.read_csv(SIS_file)
sis_data.dtypes

Student Number                      int64
Gender                             object
Ethnicity                          object
School Name                        object
Grade Level                         int64
Has Section 504 Indicator          object
Has Special Education Indicator    object
dtype: object

In [32]:
usage_data = pd.read_csv(usage_file).set_index("Student Number").transpose()
usage_data = usage_data.reset_index()
usage_data.head()

Student Number     index  Grade Level  Total Minutes on Learning System
0               21500490            4                                20
1               21500491            4                                25
2               21500492            4                                30
3               21500493            4                                35
4               21500494            4                                50

In [33]:
usage_data = usage_data.rename(columns={"index":"Student Number"})
usage_data["Student Number"] = usage_data["Student Number"].astype(int)
usage_data.dtypes

Student Number
Student Number                      int32
Grade Level                         int64
Total Minutes on Learning System    int64
dtype: object

In [34]:
new = ach_data["Student Number"].str.split("_", n=1, expand = True)
print(new)

      0         1
0    G4  21500490
1    G4  21500491
2    G4  21500492
3    G4  21500493
4    G4  21500494
..   ..       ...
444  G8  21500965
445  G8  21500966
446  G8  21500967
447  G8  21500968
448  G8  21500969

[449 rows x 2 columns]

In [35]:
ach_data["Student Number"] = new[1].astype(int)
ach_data.head()

,Student Number,Grade Level,Pre-Achievement Date,Pre-Achievement Score,Post-Achievement Date,Post-Achievement Score
0,21500490,4,42955,15.0,43235,16.0
1,21500491,4,42955,20.0,43235,20.0
2,21500492,4,42955,10.0,43235,7.0
3,21500493,4,42955,30.0,43235,25.0
4,21500494,4,42955,40.0,43235,50.0

In [36]:
merged_data = pd.merge(sis_data, ach_data, on="Student Number", how="left")
merged_data.head()

,Student Number,Gender,Ethnicity,School Name,Grade Level_x,Has Section 504 Indicator,Has Special Education Indicator,Grade Level_y,Pre-Achievement Date,Pre-Achievement Score,Post-Achievement Date,Post-Achievement Score
0,21500969,F,black,Lunar Blue School,8,False,False,8.0,42955.0,35.0,43235.0,14.0
1,21500968,F,black,Lunar Blue School,8,False,False,8.0,42955.0,30.0,43235.0,17.0
2,21500967,F,black,Lunar Blue School,8,False,False,8.0,42955.0,55.0,43235.0,74.0
3,21500966,F,black,Lunar Blue School,8,False,False,8.0,42955.0,50.0,43235.0,77.0
4,21500965,F,black,Lunar Blue School,8,False,False,8.0,42955.0,5.0,43235.0,4.0

In [37]:
merged_data = pd.merge(merged_data, usage_data, on="Student Number", how="left")
merged_data = merged_data.drop(columns={"Grade Level_y", "Grade Level"}).rename(columns={"Grade Level_x":"Grade Level"})
merged_data.head()

,Student Number,Gender,Ethnicity,School Name,Grade Level,Has Section 504 Indicator,Has Special Education Indicator,Pre-Achievement Date,Pre-Achievement Score,Post-Achievement Date,Post-Achievement Score,Total Minutes on Learning System
0,21500969,F,black,Lunar Blue School,8,False,False,42955.0,35.0,43235.0,14.0,62.0
1,21500968,F,black,Lunar Blue School,8,False,False,42955.0,30.0,43235.0,17.0,57.0
2,21500967,F,black,Lunar Blue School,8,False,False,42955.0,55.0,43235.0,74.0,29.0
3,21500966,F,black,Lunar Blue School,8,False,False,42955.0,50.0,43235.0,77.0,28.0
4,21500965,F,black,Lunar Blue School,8,False,False,42955.0,5.0,43235.0,4.0,8.0

In [38]:
merged_data = merged_data.set_index("Student Number")
merged_data.head()

,Gender,Ethnicity,School Name,Grade Level,Has Section 504 Indicator,Has Special Education Indicator,Pre-Achievement Date,Pre-Achievement Score,Post-Achievement Date,Post-Achievement Score,Total Minutes on Learning System
Student Number,,,,,,,,,,,
21500969,F,black,Lunar Blue School,8,False,False,42955.0,35.0,43235.0,14.0,62.0
21500968,F,black,Lunar Blue School,8,False,False,42955.0,30.0,43235.0,17.0,57.0
21500967,F,black,Lunar Blue School,8,False,False,42955.0,55.0,43235.0,74.0,29.0
21500966,F,black,Lunar Blue School,8,False,False,42955.0,50.0,43235.0,77.0,28.0
21500965,F,black,Lunar Blue School,8,False,False,42955.0,5.0,43235.0,4.0,8.0

In [40]:
merged_data.to_csv("data/merged_data.csv", index=True, header=True)